<template>
    <div>
        <TopButton/>
        <HeaderWapper/>
        <ArticleTitle :articleId="aid"/>
        <div class="body-wrapper">
        <div class="body">
            <div class="content">
                <p>
                    我对死亡一向有难言说的恐惧。这种让人入眠前面对黑暗无比心慌的感觉源于曾参加过的两场葬礼。第一次发生在小学的时光，其实细节我已经忘了大半。依稀中记得是上课时被班主任从后门唤走，顺着校门出去便上了父母备好的车，一溜烟地开去火车站。后来是如何赶到老家农村，又是如何安顿，或者发生了什么更重要的事情，已经全然不知，但是下葬那天乌泱泱的一片人海是永远刻在了记忆中。
                </p>
                <p>
                    下葬时天气与周遭景物已经被摄像聚焦时虚化掉。我站在母亲旁攥着她的手，随着人们站成夹道的两条队伍。出丧的几个中年人穿着一身白衣，抬着一口大棺材，缓缓地在人们目光中向村口走去。后面跟着另一群身着白衣的奏乐师，唱着唢呐铜锣和人声混合交织的丧歌。我在震耳欲聋的音乐中仍不忘自己好学生的身份，指着随音浪上下浮沉的大盒子，提出了自己的疑问：“妈妈，那个是什么？”
                </p>
                <p>
                    “人走了以后，就要住在那个里面。”
                </p>
                <p>
                    人为什么要走？要走去哪里？我尚且没有这么刨根问底的思考，而住在一个不过比身体更宽大了一些的盒子里，是我不能理解和接受的。盒子里是否有丰盛的美食和清凉的饮料？无聊的时候有朋友可以聊天吗？夏季热到脱相，或冬季冷到发抖的时候该怎么办呢？一时间难以释怀。
                </p>
                <p>
                    直到借助网络，我才知道死亡原来是失去知觉，“死掉了”。我对母亲的欺骗感到忿懑，但同时好奇死亡究竟是怎样的体验。每到夜晚不自觉想起这个难题，我就会在床上躺好一个放松的姿势，闭目凝神，渐渐闭气，试着失去知觉。但大部分时候都是入睡比死亡更先来到。原来每日的睡觉都是为将来的死亡演习，至少我得到了一个答案。
                </p>
                <p>
                    时隔几年，在高一的时候我参加了爷爷的葬礼。那时我才知道小学时是在村内颇有声望的曾祖父过世了，因而有轰动一时的景象。我与这曾祖父未曾谋面，甚至连像样的描述都没有听到过，作为三辈之内的亲爷爷，也因为远在他方，鲜少见面。连过年这种大事都不能做到一年一次，可见我与他的相识有多浅。对于孩童的我，似乎两者的归宿都是在陌生人的棺材里，在众人的哀悼中结束的。
                </p>
                <p>
                    所幸我还记得爷爷葬礼的一些细节。一直身伴癌症的老人在某天晚上悄然离世，在旁人眼里是理所应当的事情。午夜时分接到过世的消息，我们全家顾不上买高铁票的时间，收拾了行李就开车上路。丧事在农村有一套繁细的流程，从穿丧服到入棺，还有灵堂祭奠，从尸骨火化到下葬入土，其中的各种细节已经难以描述了。唯记得父亲作为长子，需要跪在灵堂中接受各位前来哀悼，而要跪上三四天。最后一天的晚上，众人散去，我们一家人聚在小屋子里，父亲看着那口棺材，掩面痛哭。在外人面前保持严谨坚强的姿态，在自家人面前完全卸下，一时让我也潸然泪下。父亲在去世的爷爷前痛哭，我因为父亲的悲伤而哭泣，我们的泪都是为最亲密的人而流的。母亲走过来抱着我的头抚慰，已经失去母亲和哥哥的她，是深谙生死之道的。
                </p>
                <p>
                    按照规矩丧事完毕后，要宴请这段时间帮了忙的亲戚朋友们。父亲没有心情出席，母亲还在内厨准备酒菜，一个高中生落座宴席，在觥筹交错中显得拘束。众位某姨太的某兄弟姊妹的儿子女儿，或是祖母的某子女的某叔舅的某侄儿侄女，聊天前要花大把时间理顺家谱关系，也就干脆专注于喝酒吃菜，和旁人随处聊聊。同桌的一个中年男性提出让我一个小毛孩学学喝白酒，也能涨涨见识。我婉拒无果，另一个男性又给我递酒杯，在纠结喝酒时宜中，父亲出来将我领进内屋。只见奶奶和母亲坐在柴火垛旁默默吃食，小叔一家在桌子旁坐着，父亲进去加了把柴火。只剩筷子敲击瓷碗和火焰轻轻跳动的声音。对于外面的人，爷爷不过是进了一个陌生人的棺材罢了。
                </p>
                <p>
                    对于我，又何尝不是呢。人呐，对亲密的人爱的厚重，对疏远的人爱的浅薄。死，不过是断了气，失去感知而长眠，而死后已无情感，却还纠葛着生者，让亲近的人落泪。一个人的死可以很轻易，悄无声息的死，却很少见。我每每想到自己亲近喜爱的人，终有一日会和世界告别，难免觉得恐惧心慌，自己作为世界的一份子，也会有临终之时，更是不敢妄谈自尽这种大事。模拟死亡的小把戏，也早在担忧中不会了。转念一想，那么多轻视生命之人，是否就是已经放下生的纠葛，决心进入陌生人的棺材里呢？
                </p>
            </div>
        </div>
    </div>
        <FooterWapper/>
    </div>
</template>

<script setup>
import HeaderWapper from '../components/HeaderWapper.vue'
import FooterWapper from '../components/FooterWapper.vue'
import TopButton from '../components/TopButton.vue'
import ArticleTitle from '../components/ArticleTitle.vue'
const aid = "0001";

</script>

<style scoped>
.body-wrapper {
    width: 100%;
    margin: 0 auto;
}

.body {
    width: 1200px;
    margin: 0 auto;
}

.content {
  margin: 0 auto;
  width: 680px;
  color: var(--main-color-black);
  font-family: "Open Sans", "\5FAE\8F6F\96C5\9ED1";
  font-size: 1rem;
  font-weight: 200;
  line-height: 1.5;
  letter-spacing: 0.05rem;
  text-align: center;
}

.content p {
  text-align: justify;
  text-indent: 2rem;
}

.content img {
  width: 80%;
  margin: 0 auto;
  object-fit: contain;
}

.content span {
  display: block;
  text-align: center;
  font-size: 0.8rem;
  font-weight: 200;
  color: var(--main-color-grey);
}
</style>