const articleList = [
    {
        "id": 5,
        "name": "开始跑步之后",
        "date": "2022年11月23日",
        "tag": "跑步",
        "img": "5-1.jpeg",
        "md": "20221123",
        "des": "明天是否会继续跑下去，我不知道，至少今天跑了"
    },
    {
        "id": 4,
        "name": "Xbox Series2上手体验",
        "date": "2022年11月12日",
        "tag": "life",
        "img": "4-1.jpeg",
        "md": "20221106",
        "des": "使用游戏手柄的人生第一次！"
    },
    {
        "id": 3,
        "name": "在一次旅途中找寻平静与感动",
        "date": "2022年11月10日",
        "tag": "game",
        "img": "3-1.jpeg",
        "md": "20221110",
        "des": "阿图尔叔叔安静地离去，卸下了我对这个游戏最后的防备"
    },
    {
        "id": 2,
        "name": "随笔 - 又一次失败",
        "date": "2022年11月6日",
        "tag": "write",
        "img": "2-1.jpeg",
        "md": "20221106",
        "des": "我们还应该继续相信奇迹吗？"
    },
    {
        "id": 1,
        "name": "随笔 - 陌生人的棺材",
        "date": "2022年3月14日",
        "tag": "write",
        "img": "1.jpg",
        "md": "20221006",
        "des": "我对死亡一向有难言说的恐惧。这种让人入眠前面对黑暗无比心慌的感觉源于曾参加过的两场葬礼。"
    }
]

export default {
    articleDatabase: articleList
}